tap "hashicorp/tap"
tap 'homebrew/bundle'

# fs/network
brew "tree"

# search/grep/diff
brew "bat"
brew "fzf"
brew "jq"
brew "autojump"
brew "ripgrep"

# sync data
brew "rsync"

# ctags
brew "ctags"

# languages/tools
brew "fnm"
brew "go"
brew "pyenv"

# terminal
brew "tmux"

# kubernetes
brew "k9s"
brew "kubectl"
brew "kubectx"
brew "kubefwd"
brew "helm"
brew "minikube"
brew "skaffold"

brew "ansible"

# hashicorp
brew "terraform"

# protocol buffer
brew "protobuf"

# mongodb
brew "mongosh"

brew "lazygit"
brew "exa"
brew "tldr"
