tap "hashicorp/tap"
tap 'homebrew/bundle'

# fs/network
brew "tree"

# search/grep/diff
brew "bat"
brew "fzf"
brew "jq"
brew "autojump"
brew "ripgrep"

# sync data
brew "rsync"

# ctags
brew "ctags"

# languages/tools
brew "fnm"
brew "go"
brew "pyenv"
brew "uv"

# terminal
brew "tmux"
brew "tmux-mem-cpu-load"

# kubernetes
brew "k9s"
brew "kubectl"
brew "kubectx"
brew "kubespy"
brew "kustomize"
brew "k8sgpt"
brew "helm"
brew "minikube"
brew "skaffold"
brew "stern"
# brew "colima"

brew "ansible"

# hashicorp
brew "terraform"

# argocd
brew "argocd"

# protocol buffer
brew "protobuf"

# mongodb
brew "mongosh"

brew "buf"
brew "hugo"
brew "fd"
brew "lazygit"
brew "pre-commit"
brew "tldr"
brew "wrk"
brew "watch"
brew "glances"
brew "grpcurl"
brew "neovim"
